{"name":"Matt J. Heroux","email":"http://mrheroux.com/contact","objective":"Project Lead - Full Stack Developer","description":"Experienced full-stack developer seeking opportunity to bring knowledge leading and developing open source web solutions to your team.","sections":[{"title":"skills","list":["Full-Stack (Open Source) Development","Responsive Web Design","Graphic Design","Project Management","Coding and Scripting","Documentation","Database Development","Troubleshooting and Debugging","Customer Relations"]},{"title":"Professional Experience","array":[{"title":"Web Developer","date":"2016 to Present","description":"Marlboro College (Liberal-Arts College) — Marlboro and Brattleboro, Vermont.","array":[{"title":"FULL-STACK DEVELOPMENT. Develop, design, maintain and manage college website applications and associated servers. Develop customized web applications to meet the academic and business needs of the institution.","array":["Build, maintain, design and oversee all internal and external websites for the college including the web framework and associated databases;","Collaborate and coordinate with staff, faculty and students relative to content, applications, design, information architecture, structure, and user interface of college websites;","Redesign and enhance websites to improve the functionality, look, and utilization;","Research, evaluate and implement new web-related technology where appropriate to enhance the functionality and utilization of all Marlboro websites;","Identify, troubleshoot and resolve web operational and accessibility issues."]}]},{"title":"Lead Web Developer","date":"2012 to 2016","description":"JNH Environmental Services, Inc. (Turnkey EHS Services Provider) — Rutland and Brandon, Vermont.","array":[{"title":"FULL-STACK DEVELOPMENT. Spearheaded both the front-end and back-end development of proprietary web services.","array":["Enabled for the proper characterization, packaging, labeling, shipping, and tracking of thousands of hazardous shipments in United States and Canada annually through the development of a comprehensive waste management system.","Managed chemicals for facilities across the Continental United States through the development of a chemical/product management system, which manages safety data sheets, governs chemical approvals, generates GHS compliant product labels, inventories chemicals, tracks materials, etc.","Trained, assessed, certified, and managed records for thousands of individuals by programming an online learning system that offers courses that meet training requirements defined by clients and federal, state, and local regulations.","Enabled clientele and field service personnel to obtain instantaneous facility reports by developing a comprehensive environmental reporting system, which generates air emission, chemical, groundwater, stormwater, et al. reports.","Protected clientele by introducing a compliance assurance system including the following: management of change, file management, calendar/events, resource center, et al.","Protected clientele content and trade secrets from unauthorized users by developing a secure authentication system that manages users, groups, and facilities permissions; provides encryption; access history; and brute force protection.","Architected the development of SaaS services through the design of databases, tables, relationships, and automated routines.","Obtained data for employee payroll and improved tracking billable time by creating a timesheet and project management system using C#, ASP.NET, and .NET framework."]},{"title":"PROJECT MANAGEMENT. Managed projects throughout all development phases.","array":["Decreased development requirements by leading a team in the creation and maintenance of in-house mobile-friendly custom-written Content Management System (CMS) built primarily with PHP, MySQL, HTML5, CSS3, JavaScript, jQuery, BASH, and Git.","Reduced development costs and times by introducing Agile Development (including SCRUM) into company's pipeline.","Completed projects on time and within budget by effectively communicating with staff, subcontractors, vendors, and clientele."]},{"title":"ART DESIGN. Created assets to help promote the company's brand and products.","array":["Revitalized company image by refining the company's logo and working with the USPTO on registration.","Increased client retention by designing a mailing list system and working with vendors to create promotional artwork and items including: shirts, signs, lanyards, pens, mouse pads, flash lights, mats, holiday cards (2013 to 2016), mugs, flash drives, et al.","Improved SEO ranking and creditability by revamping the company's main website with in-house CMS, Bootstrap, et al. technologies.","Generated web assets and print assets, including report covers, presentations themes, web images, icons, banners, facility logos, etc."]},{"title":"HARDWARE. Researched, built, and maintained systems designed to support current needs and allow for growth.","array":["Supported reliable web application design by selecting and managing web development back-end, including CentOS Linux servers.","Enabled employees to perform daily job duties by selecting, configuring, and/or maintaining company's infrastructure including: workstations, network configurations, NAS servers, VoIP systems, printers, fax machine, et al."]},{"title":"ENGINEERING. Created engineering deliverables that were reviewed, approved, and certified by Professional Engineers.","array":["Defined project requirements through requirements analysis, design, implementation, testing and evolution of products and through working with clients, consulting authorities, and learning applicable federal, state, and local regulations.","Fought to get clientele back on track by authoring site-specific plans, reports, and systems designed to meet applicable regulations.","Designed facility sitemaps to accompany deliverables using CAD (DraftSight), SketchUp, Kerkythea (Render), ZBrush, etc.","Protected human health and the environment as well as ensured compliance by conducting analytical testing, performing engineering calculations (e.g. stack testing, industrial hygiene exposure, etc.), and authoring reports."]}]},{"title":"Programmer Operator","date":"2006 to 2011","description":"Leddy Group (Staffing Agency) / Questech® Corporation (Decorative Accessories Manufacturer) — Rutland, Vermont.","array":[{"title":"FULL-STACK (CLOSED SOURCE) DEVELOPMENT. Developed software applications and tools used on multiple abstraction layers.","array":["Programmed RJ-32 FANUC® robotics systems to get manufacturing robots to meet manufacturer production requirements using VB.NET, .NET, FANUC® TP (self-taught), KAREL (self-taught), HTML5, CSS3, JavaScript, et al.","Replaced inefficient multiple programs process with single precise system that ran every part flawlessly; increased quality and allowed for the reduction of metal material costs by 50%; reduced setup times by 600%; reduced downtimes (e.g. unnecessary and/or slow movements, time spent enabling protective shield, etc.); virtually eliminated scrap even on warped parts; maximized production rates; increased buff wheel life by 300%; reduced compound usage by >50%, which reduced cleaning efforts; reduced operator knowledge requirements; protected the safety of employees through safety parameter checks; accounted for environmental variables such as material selection, part specification, wheels' dimensions, equipped jigs, et al.; etc.","Programmed GUI application using .NET that displayed robot's stats, allowed users to select input part settings (e.g. width, height, etc.), and featured rich web documentation to assist operators.","Programmed robots to perform square root calculations and other algorithms (such as Pythagorean Theorem, warp offset modifiers, etc.), which were used to determine operator's daily production rates, optimal target paths, and coordinates.","Collaborated with Maintenance and R&D to design new product lines and robot attachments."]}]},{"title":"Web Developer / Game Developer","date":"2004 to 2006","description":"Small Startup Studio (Game Designer) — Online.","array":[{"title":"FULL-STACK DEVELOPMENT. Managed a team of eight (8) developers to release orignal game for entry in PS2Dev competition.","array":["Built development platform utilizing LAMP, Wordpress, phpBB, punBB, DokuWiki, et al. to enable users to collaborate effectively.","Authored Game Design Document, which defined requirements of the development.","Programmed 2D isometric game engine for Portable Sony PlayStation® primarily using Lua.","Programmed visual level editor in C# and .NET for quick and efficient level design.","Designed interface elements through pixel incorporation to effectively communicate game stats on mobile (3.8 inch) screen."]}]},{"title":"Layout Editor","date":"2003","description":"Lyndon Institute (Independent Publication) — Lyndon Center, Vermont.","array":[{"title":"LAYOUT DESIGN: Arranged and balanced content for reoccurring publication using primarily Adobe® Illustrator."}]}]},{"title":"Teaching Experience","array":[{"title":"Marlboro College Graduate & Professional Studies (Graduate School) — Brattleboro, Vermont.","description":"Guest Speaker - MAT603 Web Design and Media Production.","date":"October 9, 2016"},{"title":"JNH Environmental Services, Inc. (Turnkey EHS Services Provider) — Rutland, Vermont.","description":"Provided instruction to online students and updated classroom materials for courses including IATA - Dangerous Goods Regulations, Resource Conservation and Recovery Act, Department of Transportation Hazardous Materials Regulations, Globally Harmonized System, and Clean Water Act.","date":"2012 to 2016"},{"title":"Department of Motor Vehicles Agency of Transportation (State Agency) — St. Johnsbury, Vermont.","description":"Assisted in providing motorcycle training as part of the Vermont Rider Education Program.","date":"2004"}]},{"title":"Education","array":[{"title":"Master of Science, major in Project Management","description":"Marlboro College Graduate & Professional Studies, Marlboro, Vermont","date":"Anticipated 2019"},{"title":"Bachelor of Science, major in Computer Information Systems/Business","description":"Castleton University, Castleton, Vermont","date":"2012"},{"title":"Associate of Science, major Computer Systems Management","description":"Community College of Vermont, Newport, Vermont","date":"2009"}]},{"title":"Certifications","array":[{"title":"AWS Summit & Technical Essentials Bootcamp","description":"Jarvis Center and Convene, New York, New York","date":"August 14-15, 2017"},{"title":"Fundamentals of Web Design","description":"Cisco Systems Networking Academy, Lyndon Center, Vermont","date":"2005"},{"title":"Leadership Conference","description":"Skills USA, Burlington, Vermont","date":"2005"}]},{"title":"Awards","array":[{"title":"SkillsUSA Computer Programming","description":"Programmed a banking system to win 2nd place in SkillsUSA State of Vermont competition for computer programming.","date":"2005"},{"title":"Senator James M. Jeffords Award","description":"Painted to win the Senator James M. Jeffords award in statewide art competition.","date":"2005"},{"title":"American Computer Science League","description":"Programmed several applications over the course of the year to win 1st place in American Computer Science League competition.","date":"2003 to 2004"}]}]}